lert("Қош келдіңіз, саяхатшы! Сіз саяхатқа шыққалы жатырсыз. Сіздің таңдауыңыз - сіздің тағдырыңызды анықтайды.");


let name = prompt("Сіздің атыңызды енгізіңіз:");
alert("Қош келдіңіз, " + name + "! Енді сіздің шытырман оқиғаңыз басталады!");


let step1 = prompt("Сіз қиылыста тап боласыз. Сіз 'солға' немесе 'оңға' барасыз ба?");
if (step1.toLowerCase() == "солға") {
    alert("сіз өте қорқынышты жерге тап болдыңыз айналаңызда көптеген жыртқыш аңдар бар.");
} else if (step1.toLowerCase() == "оңға") {
    alert("Сіз әдемі далаға шығып барасыз, және ол жерде сарқырамадан сарқылдап су ағып тұр.");
} else {
    alert("Сіздің таңдауыңыз түсініксіз. Сіз орманда адасып қалдыңыз.");
}


let step2 = prompt("Сіз өзенді көріп тұрсыз. Сіз салдың үстінен 'жүзесіз' бе әлде 'қайық' жасайсыз ба?");
if (step2.toLowerCase() == "жүземін") {
    alert("ол суда қолтырауындар бар еді бірақ сіз тез жүзіп аман қалдыңыз.");
} else if (step2.toLowerCase() == "қайық") {
    alert("Сіз қауіпсіз жолды таңдадыңыз және өзеннен оңай өттіңіз.");
} else {
    alert("Сіз бір орында қорқып тұрып қалдыңыз.");
}


let step3 = prompt("Сіз қазына сандығын табасыз. Сіз оны 'ашасыз' немесе 'тиіспейсіз' бе?");
if (step3.toLowerCase() == "ашамын") {
    alert("Құттықтаймыз, " + name + "! Сіз сандықтың ішінен көптеген қазынаны таптыңыз!");
} else if (step3.toLowerCase() == "тиіспеймін") {
    alert("Сіз сандықты біреудікі деп ойлап сізге бұйырып тұрған қазынаны алмай кеттіңіз.");
} else {
    alert("Сіз абайсызда сандықты құлатып алдыңыз және ол жоғалып кетті.");
}


alert("Сіздің шытырман оқиғаңыз аяқталды! Рақмет, " + name + ", сіздің батылдығыңыз үшін!");
